[
    {
        "Profiles": [
            {
                "UserQuestions": [
                    {
                        "Id": 1,
                        "QuestionAsk": "What song does Ferris play on the his keyboard?",
                        "AnswerOne": "The Blue Danube",
                        "AnswerTwo": "Therman Waltz",
                        "AnswerThree": "Danube Maiden",
                        "AnswerFour": "Wings of the Phoenix",
                        "AnswerCorrect": "The Blue Danube",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 2,
                        "QuestionAsk": "What kind of candy does the girl on the bus give to Rooney?",
                        "AnswerOne": "Starburst",
                        "AnswerTwo": "M&Ms",
                        "AnswerThree": "Gummy Bears",
                        "AnswerFour": "Snickers",
                        "AnswerCorrect": "Gummy Bears",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 3,
                        "QuestionAsk": "What Beatles does Ferris quote?",
                        "AnswerOne": "Paul",
                        "AnswerTwo": "John",
                        "AnswerThree": "Ringo",
                        "AnswerFour": "George",
                        "AnswerCorrect": "John",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 4,
                        "QuestionAsk": "What is the name of the school nurse?",
                        "AnswerOne": "Florence Vincent",
                        "AnswerTwo": "Florence McGuigann",
                        "AnswerThree": "\r\nFlorence Elliot",
                        "AnswerFour": "Florence Sparrow",
                        "AnswerCorrect": "Florence Sparrow",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 5,
                        "QuestionAsk": "Who tells Jeanie that she wears too much make-up?",
                        "AnswerOne": "Economics Teacher",
                        "AnswerTwo": "Ferris",
                        "AnswerThree": "Guy in the Police Station",
                        "AnswerFour": "Ed Rooney",
                        "AnswerCorrect": "Guy in the Police Station",
                        "Topic": "\r\nFerris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 6,
                        "QuestionAsk": "What does the plate on Cameron's Dad car read?",
                        "AnswerOne": "4FDDO",
                        "AnswerTwo": "NRVOUS",
                        "AnswerThree": "2MUCH",
                        "AnswerFour": "WRRIED",
                        "AnswerCorrect": "NRVOUS",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 7,
                        "QuestionAsk": "What do most guys call Jeanie?",
                        "AnswerOne": "Shauna",
                        "AnswerTwo": "Louise",
                        "AnswerThree": "Melissa",
                        "AnswerFour": "Tawnie",
                        "AnswerCorrect": "Shauna",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 8,
                        "QuestionAsk": "What is the name of the Georges Seurat painting that Cameron admires?",
                        "AnswerOne": "The Siene at La Grande Jatte",
                        "AnswerTwo": "\r\nBathing at Asnieres",
                        "AnswerThree": "Sunday Afternoon on the Island of La Grande Jatte",
                        "AnswerFour": "The Channel at Gravelines Petit Fort Philippe",
                        "AnswerCorrect": "\r\nSunday Afternoon on the Island of La Grande Jatte",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 10,
                        "QuestionAsk": "The Chicago Cubs play what team during the baseball scene?",
                        "AnswerOne": "New York Yankees",
                        "AnswerTwo": "Boston Red Sox",
                        "AnswerThree": "Atlanta Braves",
                        "AnswerFour": "Chicago White Sox",
                        "AnswerCorrect": "Atlanta Braves",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    },
                    {
                        "Id": 11,
                        "QuestionAsk": "During the parade, they go past a movie theater what movie is showing?",
                        "AnswerOne": "Godzilla's Revenge",
                        "AnswerTwo": "Godzilla vs. Mechagodzilla",
                        "AnswerThree": "\r\nGodzilla, Kind of Monsters",
                        "AnswerFour": "Godzilla 85",
                        "AnswerCorrect": "Godzilla 85",
                        "Topic": "Ferris Bueller's Day Off",
                        "ProfileId": 1
                    }
                ],
                "Id": 1,
                "Username": "Lannister",
                "Sex": "Female",
                "Age": "27",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Profile/FemaleOne.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/GameOfThrones/2.png",
                "MainPopTitle": "Games of Thrones",
                "SubPopTitle": "Mr. Robot",
                "Location": "Los Angeles",
                "MainPopFull": "Once hailed a “big-budget nerd-out,” HBO’s hit series Game of Thrones has gone beyond that, piercing the hearts of many more than the boy nerd demographic alone. Not only do non-nerds watch it, but people (yes, even women) who haven’t historically been into fantasy fall for it. And hard.\r\n\r\nSo what is it about the show that’s so compelling? It has some obvious hooks: The swordfights, the sex, the nakedness, the intrigue – we can certainly indulge in these elements, for a little escape from reality. But the show runs deeper than just fantasy escapism, and hits us on all kinds of other levels. After all, it asks us to get intimately acquainted with the characters, their histories, and their motivations, while simultaneously teaching us that we have no idea what’s going on at all. And who can resist that kind of delightful manipulation?\r\n\r\nHere are a few reasons – with the help of people who analyze and psychoanalyze pop culture for a living – that we are so into this show.",
                "SubPopFull": "I don't typically obsess over shows, but when I do it's for real. Mr. Robot is one of those unconventional series that typically don't become sensations. It panders to a niche audience, discussing topics that are foreign to the ears of most viewers. After all, the word \"hacker\" still inspires fear and mystique to the average individual, so a series on hacker culture isn't one likely to make it big. Nonetheless, it's gone on to win the Golden Globe, the Peabody Award, and six Emmy nominations since its release. \r\n\r\nEven so, whenever I talk about this show with my friends, they're typically similarly obsessed or absolutely clueless. It's a bit of a strange dichotomy, but one that I've noticed unique to this show. Perhaps it's just difficult to hate, or maybe it's because of the incredible thought that's been put into the show by its creator, Sam Esmail, that's caused it to become so relatable and likable across the board. \r\n\r\nRather than continue to rant about the popularity or its lack in regards to Mr. Robot, I've instead compiled a few observations I've made during the course of the series that have caused me to become absolutely hooked.\r\n",
                "Height": "5.9",
                "BodyType": "Fit",
                "UserId": 1
            }
        ],
        "Id": 1,
        "FirstName": "Jane",
        "LastName": "Kelly",
        "Address": "3434 Main Street",
        "City": "Los Angeles",
        "State": "CA",
        "Zipcode": 77321,
        "Phone": "343-4333",
        "Email": "jk@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 3,
                "Username": "Prison Mike",
                "Sex": "Male",
                "Age": "34",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Office/Mike.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Office/Mike.png",
                "MainPopTitle": "The Office",
                "SubPopTitle": "30 Rock",
                "Location": "Orange",
                "MainPopFull": "My current craze and obsession involves binge watching The Office 24/7, and I am not ashamed one bit to declare my love for this show. Every episode makes me uncontrollably laugh and one episode a night turns into half a season every day. I've easily come up with my ten reasons why I absolutely love The Office. Could you imagine a day at the office when Michael Scott is your manager. I can't imagine what it would be like to listen to his quirkiness or even deal with his character. The first few seasons really focus on Dwight and Jim's dysfunctional relationship and at first it mainly sticks all the shenanigans on Jim. We later see Dwight shooting more pranks on Jim and their relationship just gets better and better.",
                "SubPopFull": "I love Tina Fey, and have since before she was popular. I was thrilled when 30 Rock, her semi-autobiographical NBC sitcom about life backstage on a comedy show, became a critical and awards-show hit. I even lauded the show for its apt depiction of the varieties of workplace dissatisfaction.\r\n",
                "Height": "6.1",
                "BodyType": "Average",
                "UserId": 2
            }
        ],
        "Id": 2,
        "FirstName": "John",
        "LastName": "Frank",
        "Address": "9 First Street",
        "City": "Orange",
        "State": "CA",
        "Zipcode": 83921,
        "Phone": "575-4832",
        "Email": "jf@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 4,
                "Username": "Tracer",
                "Sex": "Female",
                "Age": "23",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Overwatch/Woman1.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Overwatch/Woman1.png",
                "MainPopTitle": "Overwatch",
                "SubPopTitle": "The Legend of Zelda: Breath of the Wild",
                "Location": "Costa Mesa",
                "MainPopFull": "I don't know why, but I always have so much fun when I play junkrat. Yesterday, some people on my team screamed in the voice chat \"WHY ARE YOU PLAYING JUNKRAT YOU IDIOT\", and I just cannot understand why. It was on defense on eisenwald. I ended getting all gold medals except healing with 40 frags, so I sort of proved them wrong, but is there a consensus that he is bad or something?\r\nAnyway, junkrats persona and playstyle go well together and he is just really fun for me. He is just fun to play, period. He has lots of area damage, he has fair mobility, he has an ability that can prevent anyone from moving no matter what, and his ult is pretty good at clearing an area. On top of that, his voice pack is so whacky and fitting plus his crazy laughs are great. \t\r\n",
                "SubPopFull": "What sets the excellent The Legend of Zelda: Breath of the Wild apart from other big games is that rather than overstimulate you, it does the opposite—it constantly sets you at ease. The game situates itself in a post-post-apocalypse: Hyrule was destroyed a century ago, and all that’s left are small villages and ruins overgrown with greenery. Nature has conquered medievalism. Through its pastoral beauty, the hugeness of Breath of the Wild becomes strangely calming.\r\nIt’s Zelda by way of Minecraft. I can already hear you shouting, “But there’s no crafting in Zelda!” at me, which, first of all, rude, and second, people always misunderstand what makes Minecraft so unique. It’s not crafting itself, but the relationship between the environment and the player. In Zelda, you hunt, you gather, but most importantly, you explore to survive. (Also, monsters come out at night.)\r\nAnd to me, that’s the biggest difference between Breath of the Wild and every other open-world game out there. It encourages you to discover its lushly rendered topographies and ecosystem by piquing your curiosity, rather than demanding you move from waypoint to waypoint (though there is a little bit of that). In creating Breath of the Wild, Nintendo sought to rethink “all of the stress points” of the Zelda series. But what they’ve done instead is reinvent the open-world game.\r\n",
                "Height": "5.3",
                "BodyType": "Slim",
                "UserId": 3
            }
        ],
        "Id": 3,
        "FirstName": "Lisa",
        "LastName": "Park",
        "Address": "282 Second Street",
        "City": "Costa Mesa",
        "State": "CA",
        "Zipcode": 98340,
        "Phone": "673-4860",
        "Email": "lp@email.com",
        "PaymentInfo": "Mastercard"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 5,
                "Username": "Chewie",
                "Sex": "Female",
                "Age": "37",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Chewie.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Chewie.png",
                "MainPopTitle": "Star Wars",
                "SubPopTitle": "Westworld",
                "Location": "Los Angeles",
                "MainPopFull": "For me, Star Wars wasn’t ever about the films. The prequels came out when I was a teenager, and I’d seen the Original Trilogy – and recognised their inherent superiority – a little earlier. But for me, the immersion came mostly from games: from early memories of X-Wing vs Tie Fighter, to playing out epic Battlefront II space battles with my brother and later, as a retro fix with my best friend at university. I remember adoring the Knights Of The Old Republic games with their sheer volume of lore: wise-cracking robots, sleek spaceships piloted by brave rogues, traitorous Sith Lords. The films will always be a cultural touchstone (and Episode I, I will always insist, is cruelly underrated). But for me Star Wars means more than who shot first, or doing Chewie impressions. It’s the universe that A New Hope started. And it’s being a kid with my friends, our imaginations fired by a galaxy far, far away.\tJust as all sentient life may arise from a single evolutionary mistake, so, too, can a love story. You mistakenly think your relationship is “fate.” You mistakenly project all your hopes and dreams onto a single person. You mistakenly justify poor behavior (“He’s just not responding to my texts because he’s busy”), and, much of the time, you don’t realize what you’re doing.\r\n",
                "SubPopFull": "HBO’s new $100 million franchise hit Westworld isn’t just examining society’s basest appetites for depravity and violence in a revolutionary fashion, it’s also providing a beautiful metaphor for breaking down the building blocks of human love (and failure to love).\r\n\r\nBy richly unpacking conversations between the sci-fi park’s operators and its android hosts about simulated consciousness, Westworld inspires important questions about how our own basic drives can be similarly examined.\r\n\r\n\r\nDo you have a “vague guilt” you’ve never dared question, like heroic cowboy Teddy (played by James Marsden), that prevents you from ever realizing love? Is your aggression dialed-up like Maeve (played by Thandie Newton) in a desperate and not even fully conscious attempt to increase your desirability?\r\n\r\nThese are questions Westworld has made me ask about my own relationship, and it’s about as close to a $40,000-a-day romp in the theme park as I’ll ever get.",
                "Height": "5.8",
                "BodyType": "Curvy",
                "UserId": 4
            }
        ],
        "Id": 4,
        "FirstName": "Nancy ",
        "LastName": "Jones",
        "Address": "89 Main Street",
        "City": "Los Angeles",
        "State": "CA",
        "Zipcode": 75638,
        "Phone": "574-9076",
        "Email": "nj@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 6,
                "Username": "Mei",
                "Sex": "Male",
                "Age": "29",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Overwatch/Cute.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Overwatch/Cute.png",
                "MainPopTitle": "Overwatch",
                "SubPopTitle": "Fallout 4",
                "Location": "Santa Ana",
                "MainPopFull": "I don't know why, but I always have so much fun when I play junkrat. Yesterday, some people on my team screamed in the voice chat \"WHY ARE YOU PLAYING JUNKRAT YOU IDIOT\", and I just cannot understand why. It was on defense on eisenwald. I ended getting all gold medals except healing with 40 frags, so I sort of proved them wrong, but is there a consensus that he is bad or something?\r\nAnyway, junkrats persona and playstyle go well together and he is just really fun for me. He is just fun to play, period. He has lots of area damage, he has fair mobility, he has an ability that can prevent anyone from moving no matter what, and his ult is pretty good at clearing an area. On top of that, his voice pack is so whacky and fitting plus his crazy laughs are great. \t\r\n",
                "SubPopFull": "It was one of the coolest things I’ve found while playing Fallout 4...and then Fallout 4 ruined it. Mere moments after I arrived at the scene, a band of raiders descended on me and started shooting. See, the raiders were the audience—they’d apparently rigged up their robots to run a race. Because the audience was hostile toward me, the robots turned on me, too. I did the only thing I could in that situation: I killed them all. Afterward, when I looted every robot’s corpse, I found out that each one actually had a special racing name. The names were clever: “Piece ‘O Junk,” and “The Boston Blaster,” for instance. I chuckled, but mostly, I felt sad that the way Bethesda let me appreciate this neat thing in my playthrough was after a mess of combat and death. \r\n",
                "Height": "5.11",
                "BodyType": "Average",
                "UserId": 5
            }
        ],
        "Id": 5,
        "FirstName": "Mike ",
        "LastName": "Doe",
        "Address": "393 Third Street",
        "City": "Santa Ana",
        "State": "CA",
        "Zipcode": 65527,
        "Phone": "464-7653",
        "Email": "md@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 7,
                "Username": "Vader",
                "Sex": "Female",
                "Age": "39",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Vadar.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Vadar.png",
                "MainPopTitle": "Star Wars",
                "SubPopTitle": "Matrix",
                "Location": "Irvine",
                "MainPopFull": "For me, Star Wars wasn’t ever about the films. The prequels came out when I was a teenager, and I’d seen the Original Trilogy – and recognised their inherent superiority – a little earlier. But for me, the immersion came mostly from games: from early memories of X-Wing vs Tie Fighter, to playing out epic Battlefront II space battles with my brother and later, as a retro fix with my best friend at university. I remember adoring the Knights Of The Old Republic games with their sheer volume of lore: wise-cracking robots, sleek spaceships piloted by brave rogues, traitorous Sith Lords. The films will always be a cultural touchstone (and Episode I, I will always insist, is cruelly underrated). But for me Star Wars means more than who shot first, or doing Chewie impressions. It’s the universe that A New Hope started. And it’s being a kid with my friends, our imaginations fired by a galaxy far, far away.\tJust as all sentient life may arise from a single evolutionary mistake, so, too, can a love story. You mistakenly think your relationship is “fate.” You mistakenly project all your hopes and dreams onto a single person. You mistakenly justify poor behavior (“He’s just not responding to my texts because he’s busy”), and, much of the time, you don’t realize what you’re doing.\r\n",
                "SubPopFull": "The second reason The Matrix did so well is that it’s very, very good. Even now, after two decades of other films aping its visual style and special effects, the original remains instantly hooky, with one grabby scene after another. And I’m not just talking about the action sequences, which actually have lost a little of their power to thrill, after so much repetition. The plot itself has a highly satisfying structure, first introducing super-hacker Thomas “Neo” Anderson (Reeves), then having Neo discover that there’s another layer of reality beneath what his conscious mind has always known. Once Neo learns that his real body is actually plugged into a machine in a dystopian future, there follows an unplugging, and then an extended training sequence, during which he learns to manipulate reality inside “The Matrix,” thus aiding the surviving humans in the rebellion against their mechanical oppressors. It’s a classic hero’s journey, bolstered by the feeling of true revelation—“Ah, so this is why the world feels so phony sometimes”—buoyed by the movie’s fairly sophisticated conversations about what “reality” and “destiny” mean.\r\n",
                "Height": "5.4",
                "BodyType": "Average",
                "UserId": 6
            }
        ],
        "Id": 6,
        "FirstName": "Judy",
        "LastName": "Benis",
        "Address": "389 Main Street",
        "City": "Irvine",
        "State": "CA",
        "Zipcode": 56570,
        "Phone": "999-3474",
        "Email": "jb@email.com",
        "PaymentInfo": "Mastercard"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 8,
                "Username": "Fetta",
                "Sex": "Male",
                "Age": "21",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Fetta.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/StarWars/Fetta.png",
                "MainPopTitle": "Star Wars",
                "SubPopTitle": "The Office",
                "Location": "Orange",
                "MainPopFull": "For me, Star Wars wasn’t ever about the films. The prequels came out when I was a teenager, and I’d seen the Original Trilogy – and recognised their inherent superiority – a little earlier. But for me, the immersion came mostly from games: from early memories of X-Wing vs Tie Fighter, to playing out epic Battlefront II space battles with my brother and later, as a retro fix with my best friend at university. I remember adoring the Knights Of The Old Republic games with their sheer volume of lore: wise-cracking robots, sleek spaceships piloted by brave rogues, traitorous Sith Lords. The films will always be a cultural touchstone (and Episode I, I will always insist, is cruelly underrated). But for me Star Wars means more than who shot first, or doing Chewie impressions. It’s the universe that A New Hope started. And it’s being a kid with my friends, our imaginations fired by a galaxy far, far away.\tJust as all sentient life may arise from a single evolutionary mistake, so, too, can a love story. You mistakenly think your relationship is “fate.” You mistakenly project all your hopes and dreams onto a single person. You mistakenly justify poor behavior (“He’s just not responding to my texts because he’s busy”), and, much of the time, you don’t realize what you’re doing.\r\n",
                "SubPopFull": "\r\nMy current craze and obsession involves binge watching The Office 24/7, and I am not ashamed one bit to declare my love for this show. Every episode makes me uncontrollably laugh and one episode a night turns into half a season every day. I've easily come up with my ten reasons why I absolutely love The Office. Could you imagine a day at the office when Michael Scott is your manager. I can't imagine what it would be like to listen to his quirkiness or even deal with his character. The first few seasons really focus on Dwight and Jim's dysfunctional relationship and at first it mainly sticks all the shenanigans on Jim. We later see Dwight shooting more pranks on Jim and their relationship just gets better and better.",
                "Height": "5.9",
                "BodyType": "Fit",
                "UserId": 7
            }
        ],
        "Id": 7,
        "FirstName": "Mark ",
        "LastName": "Calls",
        "Address": "2719 First Street",
        "City": "Newport Beach",
        "State": "CA",
        "Zipcode": 68990,
        "Phone": "563-2393",
        "Email": "mc@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 9,
                "Username": "Greyjoy",
                "Sex": "Female",
                "Age": "31",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/GameOfThrones/GameOfThrones.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/GameOfThrones/GameOfThrones.png",
                "MainPopTitle": "Games of Thrones",
                "SubPopTitle": "Westworld",
                "Location": "Costa Mesa",
                "MainPopFull": "Once hailed a “big-budget nerd-out,” HBO’s hit series Game of Thrones has gone beyond that, piercing the hearts of many more than the boy nerd demographic alone. Not only do non-nerds watch it, but people (yes, even women) who haven’t historically been into fantasy fall for it. And hard.\r\n\r\nSo what is it about the show that’s so compelling? It has some obvious hooks: The swordfights, the sex, the nakedness, the intrigue – we can certainly indulge in these elements, for a little escape from reality. But the show runs deeper than just fantasy escapism, and hits us on all kinds of other levels. After all, it asks us to get intimately acquainted with the characters, their histories, and their motivations, while simultaneously teaching us that we have no idea what’s going on at all. And who can resist that kind of delightful manipulation?\r\n\r\nHere are a few reasons – with the help of people who analyze and psychoanalyze pop culture for a living – that we are so into this show.",
                "SubPopFull": "HBO’s new $100 million franchise hit Westworld isn’t just examining society’s basest appetites for depravity and violence in a revolutionary fashion, it’s also providing a beautiful metaphor for breaking down the building blocks of human love (and failure to love).\r\n\r\nBy richly unpacking conversations between the sci-fi park’s operators and its android hosts about simulated consciousness, Westworld inspires important questions about how our own basic drives can be similarly examined.\r\n\r\n\r\nDo you have a “vague guilt” you’ve never dared question, like heroic cowboy Teddy (played by James Marsden), that prevents you from ever realizing love? Is your aggression dialed-up like Maeve (played by Thandie Newton) in a desperate and not even fully conscious attempt to increase your desirability?\r\n\r\nThese are questions Westworld has made me ask about my own relationship, and it’s about as close to a $40,000-a-day romp in the theme park as I’ll ever get.",
                "Height": "5.2",
                "BodyType": "Fit",
                "UserId": 8
            }
        ],
        "Id": 8,
        "FirstName": "Lily",
        "LastName": "Bars",
        "Address": "4299 Main Street",
        "City": "Costa Mesa",
        "State": "CA",
        "Zipcode": 67804,
        "Phone": "321-6649",
        "Email": "lb@email.com",
        "PaymentInfo": "Mastercard"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 10,
                "Username": "Sloane",
                "Sex": "Female",
                "Age": "36",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/pop.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/pop.png",
                "MainPopTitle": "Ferris Bueller's Day Off",
                "SubPopTitle": "The Big Lebowski",
                "Location": "Los Angeles",
                "MainPopFull": "With its straightforward narrative about three teenagers skipping school, “Ferris Bueller’s Day Off” doesn’t seem made for high-minded film fetishists like labyrinthine works such as “Citizen Kane,” “Apocalypse Now” or any selection from David Lynch’s catalog. Yet, as the John Hughes classic celebrates its 25-year anniversary this month, its enduring genius has indeed become a subject of esoteric speculation and multilayered theorizing.\r\n\r\nChief among the hypotheses aiming to explain “Ferris'” immortality is the eerily compelling Ferris Bueller “Fight Club” Theory. It suggests the film is a teenage version of the Chuck Palahniuk story whereby Ferris is Cameron’s hallucination à la Tyler Durden and Sloane is Marla Singer. This is an extrapolation of an earlier theory positing that while Ferris may not be a figment, he is actually the story-arc-less supporting character in a movie more accurately described as “Cameron Frye’s Day Off.”\t\r\n",
                "SubPopFull": "The Big Lebowski could so easily have descended into a checklist of absurdities for the sake of wackiness. But whimsical dialogue and surreal moments are only half of what makes the Coen brothers so remarkable as film-makers. Someone once said: \"In order to be funny you have to be sad first.\" The Big Lebowski, like almost everything in the Coens' repertoire, is deadpan hilarity tinged with the morose. There is a sense, though it plays out very quietly, that The Dude is a man whose time has passed. The real Lebwoski calls him a bum, the police throw cups at his head because he is an old hippy who contributes nothing, a local pornographer drugs him because he's a minor irritant. The film hints, but only as an aside, that money corrupts; leaving The Dude to fight a lone battle against men who \"treat objects like women\".\r\n",
                "Height": "5.9",
                "BodyType": "Curvy",
                "UserId": 10
            }
        ],
        "Id": 10,
        "FirstName": "Virginia",
        "LastName": "Grey",
        "Address": "43 North Street",
        "City": "Los Angeles",
        "State": "CA",
        "Zipcode": 90745,
        "Phone": "454-2350",
        "Email": "vg@email.com",
        "PaymentInfo": "Mastercard"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 11,
                "Username": "Grace",
                "Sex": "Female",
                "Age": "24",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/MoviePoster.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/MoviePoster.png",
                "MainPopTitle": "Ferris Bueller's Day Off",
                "SubPopTitle": "Star Wars",
                "Location": "Orange",
                "MainPopFull": "With its straightforward narrative about three teenagers skipping school, “Ferris Bueller’s Day Off” doesn’t seem made for high-minded film fetishists like labyrinthine works such as “Citizen Kane,” “Apocalypse Now” or any selection from David Lynch’s catalog. Yet, as the John Hughes classic celebrates its 25-year anniversary this month, its enduring genius has indeed become a subject of esoteric speculation and multilayered theorizing.\r\n\r\nChief among the hypotheses aiming to explain “Ferris'” immortality is the eerily compelling Ferris Bueller “Fight Club” Theory. It suggests the film is a teenage version of the Chuck Palahniuk story whereby Ferris is Cameron’s hallucination à la Tyler Durden and Sloane is Marla Singer. This is an extrapolation of an earlier theory positing that while Ferris may not be a figment, he is actually the story-arc-less supporting character in a movie more accurately described as “Cameron Frye’s Day Off.”\t\r\n",
                "SubPopFull": "For me, Star Wars wasn’t ever about the films. The prequels came out when I was a teenager, and I’d seen the Original Trilogy – and recognised their inherent superiority – a little earlier. But for me, the immersion came mostly from games: from early memories of X-Wing vs Tie Fighter, to playing out epic Battlefront II space battles with my brother and later, as a retro fix with my best friend at university. I remember adoring the Knights Of The Old Republic games with their sheer volume of lore: wise-cracking robots, sleek spaceships piloted by brave rogues, traitorous Sith Lords. The films will always be a cultural touchstone (and Episode I, I will always insist, is cruelly underrated). But for me Star Wars means more than who shot first, or doing Chewie impressions. It’s the universe that A New Hope started. And it’s being a kid with my friends, our imaginations fired by a galaxy far, far away.\tJust as all sentient life may arise from a single evolutionary mistake, so, too, can a love story. You mistakenly think your relationship is “fate.” You mistakenly project all your hopes and dreams onto a single person. You mistakenly justify poor behavior (“He’s just not responding to my texts because he’s busy”), and, much of the time, you don’t realize what you’re doing.\r\n",
                "Height": "5.4",
                "BodyType": "Fit",
                "UserId": 11
            }
        ],
        "Id": 11,
        "FirstName": "Cindy",
        "LastName": "Wells",
        "Address": "4933 Main Street",
        "City": "Orange",
        "State": "CA",
        "Zipcode": 56352,
        "Phone": "592-4324",
        "Email": "cw@email.com",
        "PaymentInfo": "Mastercard"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 12,
                "Username": "Rooney",
                "Sex": "Male",
                "Age": "42",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/gallery/drawing.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/gallery/drawing.png",
                "MainPopTitle": "Ferris Bueller's Day Off",
                "SubPopTitle": "Step Brothers",
                "Location": "Irvine",
                "MainPopFull": "With its straightforward narrative about three teenagers skipping school, “Ferris Bueller’s Day Off” doesn’t seem made for high-minded film fetishists like labyrinthine works such as “Citizen Kane,” “Apocalypse Now” or any selection from David Lynch’s catalog. Yet, as the John Hughes classic celebrates its 25-year anniversary this month, its enduring genius has indeed become a subject of esoteric speculation and multilayered theorizing.\r\n\r\nChief among the hypotheses aiming to explain “Ferris'” immortality is the eerily compelling Ferris Bueller “Fight Club” Theory. It suggests the film is a teenage version of the Chuck Palahniuk story whereby Ferris is Cameron’s hallucination à la Tyler Durden and Sloane is Marla Singer. This is an extrapolation of an earlier theory positing that while Ferris may not be a figment, he is actually the story-arc-less supporting character in a movie more accurately described as “Cameron Frye’s Day Off.”\t\r\n",
                "SubPopFull": "Watching the movie now, six years after its unheralded release, Step Brothers, co-written and directed by frequent Ferrell collaborator Adam McKay, looks more and more like the funniest movie of the 21st century, and also the most accurate about the anarchy of adolescence. Compare it with say, Richard Linklater's Boyhood. The latter, lovely as it may be, is measured and sensitive, rendering the messiness of maturation with a calm hand and a steady gaze. Step Brothers, about the rivalry, subsequent camaraderie, and slight maturation of two man-child morons, is foul, sloppy, giddy, angry, obsessed with pain and penises — I know which one reminds me more of being a boy. Kids smash watermelons. They hog fancy sauce (ketchup + mayonnaise). They wear Chewbacca masks. They're each others' mortal enemies one day and treehouse buddies the next. That Dale and Brennan, playing overgrown brats forced to co-exist when their parents get married (Mary Steenburgen plays Brennan's mom; Richard Jenkins is Dale's dad) are paunchy middle-aged men doesn't make their childhood feelings any less true, or terrifying. A huge heap of growing up is a muddled disaster, and if Step Brothers were played exactly the same, but with kids cast in the lead roles rather than two hairy olds, it'd scan as a psychologically astute horror movie. \r\n",
                "Height": "5.11",
                "BodyType": "Average",
                "UserId": 12
            }
        ],
        "Id": 12,
        "FirstName": "Ben",
        "LastName": "Edson",
        "Address": "34392 Second Street",
        "City": "Irvine",
        "State": "CA",
        "Zipcode": 46289,
        "Phone": "123-6540",
        "Email": "be@email.com",
        "PaymentInfo": "Visa"
    },
    {
        "Profiles": [
            {
                "UserQuestions": [],
                "Id": 14,
                "Username": "Frye",
                "Sex": "Male",
                "Age": "22",
                "ProfilePic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/PosterDrawing.png",
                "AvatarPic": "https://stevenkimxi.github.io/PopQuiz/images/Ferris/PosterDrawing.png",
                "MainPopTitle": "Ferris Bueller's Day Off",
                "SubPopTitle": "Matrix",
                "Location": "Santa Ana",
                "MainPopFull": "With its straightforward narrative about three teenagers skipping school, “Ferris Bueller’s Day Off” doesn’t seem made for high-minded film fetishists like labyrinthine works such as “Citizen Kane,” “Apocalypse Now” or any selection from David Lynch’s catalog. Yet, as the John Hughes classic celebrates its 25-year anniversary this month, its enduring genius has indeed become a subject of esoteric speculation and multilayered theorizing.\r\n\r\nChief among the hypotheses aiming to explain “Ferris'” immortality is the eerily compelling Ferris Bueller “Fight Club” Theory. It suggests the film is a teenage version of the Chuck Palahniuk story whereby Ferris is Cameron’s hallucination à la Tyler Durden and Sloane is Marla Singer. This is an extrapolation of an earlier theory positing that while Ferris may not be a figment, he is actually the story-arc-less supporting character in a movie more accurately described as “Cameron Frye’s Day Off.”\t\r\n",
                "SubPopFull": "The second reason The Matrix did so well is that it’s very, very good. Even now, after two decades of other films aping its visual style and special effects, the original remains instantly hooky, with one grabby scene after another. And I’m not just talking about the action sequences, which actually have lost a little of their power to thrill, after so much repetition. The plot itself has a highly satisfying structure, first introducing super-hacker Thomas “Neo” Anderson (Reeves), then having Neo discover that there’s another layer of reality beneath what his conscious mind has always known. Once Neo learns that his real body is actually plugged into a machine in a dystopian future, there follows an unplugging, and then an extended training sequence, during which he learns to manipulate reality inside “The Matrix,” thus aiding the surviving humans in the rebellion against their mechanical oppressors. It’s a classic hero’s journey, bolstered by the feeling of true revelation—“Ah, so this is why the world feels so phony sometimes”—buoyed by the movie’s fairly sophisticated conversations about what “reality” and “destiny” mean.\r\n",
                "Height": "5.4",
                "BodyType": "Average",
                "UserId": 13
            }
        ],
        "Id": 13,
        "FirstName": "Rich",
        "LastName": "Close",
        "Address": "433 Main Street",
        "City": "Santa Ana",
        "State": "CA",
        "Zipcode": 68024,
        "Phone": "654-2346",
        "Email": "rc@email.com",
        "PaymentInfo": "Visa"
    }
]